app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, :blank)
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$zuaKIvzQaw7sozrejQR9rOUboeHThdyt5CTLC50.Z382BcQTac4zS"], ["updated_at", "2022-03-08 15:38:13.930484"], ["id", 101]]

    def get_user
      @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jagaimo0511@gmail.com"], ["LIMIT", 1]]