app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", 1]]
---
  def index
    @users = User.where(activated: true).paginate(page: params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "jagaimo0511@gmail.com"], ["updated_at", "2022-03-08 03:59:46.829677"], ["id", 1]]
---
  def update
    @user = User.find_by(id: params[:id])
    if @user.update_attributes(user_params)